# masw-yolo-afpn-only.yaml


nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C2f, [128, True]]      # 2  <- C2  (stride 4,  160x160)
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C2f, [256, True]]      # 4  <- C3  (stride 8,   80x80)
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C2f, [512, True]]      # 6  <- C4  (stride 16,  40x40)
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9  <- C5  (stride 32,  20x20)

head:
  # ---- AFPN: fusion تدریجی سه‌مرحله‌ای طبق شکل 3 ----
  - [[2, 4, 6, 9], 1, AFPN, [64]]  # 10  عرض داخلی fusion = 64 کانال
                                    #     خروجی: لیست [P2, P3, P4, P5] هرکدام 64ch

  # ---- استخراج هر سطح از خروجی چندتایی AFPN ----
  - [10, 1, Index, [0]]            # 11  P2  (64ch, 160x160)
  - [10, 1, Index, [1]]            # 12  P3  (64ch,  80x80)
  - [10, 1, Index, [2]]            # 13  P4  (64ch,  40x40)
  - [10, 1, Index, [3]]            # 14  P5  (64ch,  20x20)

  # ---- پالایش نهایی هر سطح قبل از Detect (عرض واقعی افزایش می‌یابد) ----
  - [11, 1, C2f, [128]]            # 15  P2 refine   (فقط اگر سر P2 فعال شود لازم است)
  - [12, 1, C2f, [256]]            # 16  P3 refine
  - [13, 1, C2f, [512]]            # 17  P4 refine
  - [14, 1, C2f, [512]]            # 18  P5 refine

  - [[16, 17, 18], 1, Detect, [nc]]
